app/controllers/admins/courses_controller.rb

INSERT INTO "courses" ("name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "curso1"], ["category", "mate"], ["created_at", "2018-08-20 03:51:31.450207"], ["updated_at", "2018-08-20 03:51:31.450207"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "name" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "curso 12"], ["updated_at", "2018-08-20 03:45:09.870174"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)