app/controllers/admins/inscriptions_controller.rb

SELECT "inscriptions".* FROM "inscriptions"
---
  def index
    @inscriptions = Inscription.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @user = User.find(@inscription.user_id)

UPDATE "inscriptions" SET "course_id" = ?, "kind" = ?, "updated_at" = ? WHERE "inscriptions"."id" = ?  [["course_id", 2], ["kind", "Profesor"], ["updated_at", "2018-08-20 05:12:11.515916"], ["id", 1]]
---
  def update
    @inscription.update(inscription_params)

SELECT  "inscriptions".* FROM "inscriptions" WHERE "inscriptions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_inscription
    @inscription = Inscription.find(params[:id])