app/views/inscriptions/new.html.erb

    <%= form.label :course_id %>
    <%= form.select :course_id, Course.pluck(:name, :id) %>
---
SELECT "courses"."name", "courses"."id" FROM "courses"