app/views/admins/inscriptions/edit.html.erb

SELECT "courses"."name", "courses"."id" FROM "courses"
---
    <%= form.label :course_id %>
    <%= form.select :course_id, Course.pluck(:name, :id) %>