app/views/admins/inscriptions/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <tr>
        <td><%= User.find(inscription.user_id).email %></td>
        <td><%= Course.find(inscription.course_id).name %></td>