app/controllers/inscriptions_controller.rb

  def create
    @inscription = Inscription.new(inscription_params)
    @inscription.kind = 'Alumno'
    @inscription.user_id = current_user.id
    @inscription.save
---
INSERT INTO "inscriptions" ("kind", "created_at", "updated_at", "user_id", "course_id") VALUES (?, ?, ?, ?, ?)  [["kind", "Alumno"], ["created_at", "2018-08-20 04:22:12.879974"], ["updated_at", "2018-08-20 04:22:12.879974"], ["user_id", 4], ["course_id", 5]]